// Задача 1-1
// Объяви две переменные хранящие название и цену товара name и price.

const name = '«Генератор защитного поля»'; // Write code in this line
let price = 1000; // Write code in this line

// Присвой переменным следующие характеристики товара (сразу при объявлении)
// название: «Генератор защитного поля»
// цена: 1000
// Используя шаблонную строку и переменные name и price задай новой переменной firstMessage текст:

// Выбран «Генератор защитного поля», цена за штуку 1000 кредитов

const firstMessage = `Выбран «Генератор защитного поля», цена за штуку 1000 кредитов`; // Write code in this line

// Присвой товару (price) новую цену - 2000

price = 2000;

// Используя шаблонную строку и переменные name и price задай новой переменной secondMessage текст:

// Выбран «Генератор защитного поля», цена за штуку 2000 кредитов

const secondMessage = `Выбран «Генератор защитного поля», цена за штуку 2000 кредитов`; // Write code in this line

console.log(firstMessage);
// 'Выбран «Генератор защитного поля», цена за штуку 1000 кредитов'

console.log(secondMessage);
// 'Выбран «Генератор защитного поля», цена за штуку 2000 кредитов'
